xml2груминг/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml2груминг/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура ПересчитатьСуммуДокумента()
   	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма")+ Объект.Товары.Итог("Сумма");
 КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПокупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Дата, Объект.Поставщик);
	Иначе
		СтрокаТЧ.Цена = 0;		
	КонецЕсли;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчитатьСуммуДокумента();

КонецПроцедуры



&НаСервере
Процедура ОбновлениеЦенВТабличнойЧасти()
	МассивНоменклатур = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Товары Цикл
	    МассивНоменклатур.Добавить(ТекСтрока.Номенклатура);
	КонецЦикла;	
	ЦеныНоменклатуры = РаботаСЦенами.ПолучитьМассивЦен1(Объект.Дата, Объект.Поставщик, МассивНоменклатур);
	Для Каждого ТекСтрока Из Объект.Товары Цикл
	    НайденнаяЦена = ЦеныНоменклатуры.Найти(ТекСтрока.Номенклатура, "Номенклатура");
	    Если НайденнаяЦена = Неопределено Тогда
	        ТекСтрока.Цена = 0;
	    Иначе
	        ТекСтрока.Цена = НайденнаяЦена.Цена;
	    КонецЕсли;
	ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
	КонецЦикла;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ОбновлениеЦенВТабличнойЧасти();
	
	// не получилось через массив структур. не смог разобраться, как их обработать в модуле формы.
	//МассивЦен = РаботаСЦенами.ПолучитьМассивЦен(Объект.Дата, Объект.Поставщик);  
	//
	//Для каждого СтрокаТЧ из Объект.Товары Цикл
	//	Если СтрокаТЧ.Номенклатура = МассивЦен.Найти(СтрокаТЧ.Номенклатура) Тогда
	//		сообщить(1);
	//	Иначе
	//		Сообщить(0);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого ЭлементМассива из МассивЦен Цикл
	//	 сообщить(СТРШаблон("%1 %2",ЭлементМассива.Номенклатура, ЭлементМассива.Цена));
	//КонецЦикла;      
	 
КонецПроцедуры
